# Parameters
nc: 44  # number of classes
depth_multiple: 0.25  # scales module repeats
width_multiple: 0.33  # scales convolution channels

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,         [32,  3, 2]]  # 0-P1/2
  - [-1, 1, Conv,         [64,  3, 2]]  # 1-P2/4
  - [-1, 1, VanillaBlock, [96,  3, 2]]  # 2-P3/8
  - [-1, 1, VanillaBlock, [192, 3, 2]]  # 3-P4/16
  - [-1, 1, VanillaBlock, [384, 3, 2]]  # 4-P5/32
  - [-1, 1, VanillaBlock, [768, 3, 1]]  # 5-P5/32

# YOLOv8.0s head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] #1/16
  - [[-1, 3], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [384]]  # 8

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] #1/8
  - [[-1, 2], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [192]]  # 11 (P3/8-small)

  - [-1, 1, Conv, [192, 3, 2]] #1/16
  - [[-1, 8], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [384]]  # 14 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 5], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [768]]  # 17 (P5/32-large)

  - [[11, 14, 17], 1, Detect, [nc]]  # Detect(P3, P4, P5)
