# Parameters
nc: 44  # number of classes
scales: 
depth_multiple: 0.25  # model depth multiple
width_multiple: 0.33  # layer channel multiple


# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, PatchEmbed_FasterNet, [64, 4, 4]]  # 0-P1/4
  - [-1, 1, BasicStage, [64, 1]]  # 1
  - [-1, 1, PatchMerging_FasterNet, [128, 2, 2]]  # 2-P2/8
  - [-1, 2, BasicStage, [128, 1]]  # 3-P3/16
  - [-1, 1, PatchMerging_FasterNet, [256, 2, 2]]  # 4
  - [-1, 8, BasicStage, [256, 1]]  # 5-P4/32
  - [-1, 1, PatchMerging_FasterNet, [512, 2, 2]] # 6
  - [-1, 2, BasicStage, [512, 1]] # 7
  - [-1, 1, SPPF, [320, 5]]  # 8


# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 5], 1, Concat, [1]]  # cat backbone P4
  - [-1, 1, C2f, [512]]  # 11

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 3], 1, Concat, [1]]  # cat backbone P3
  - [-1, 1, C2f, [256]]  # 14 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]  # cat head P4
  - [-1, 1, C2f, [512]]  # 17 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]  # cat head P5
  - [-1, 1, C2f, [1024]]  # 20 (P5/32-large)

  - [[14, 17, 20], 1, Detect, [nc]]  # Detect(P3, P4, P5)

